[
  {
    "title": "1",
    "order": "1",
    "overlay": "left",
    "name": "A season of potential",
    "score": "20-9 Regular-Season Record",
    "chatter": "The 2015-16 season began with an easy home win over Santa Clara in which senior Talia Walton set a career high with 33 points and made eight three-pointers (sound familiar?). Junior Chantel Osahor had 12 points and 20 rebounds in a win over Seattle U, becoming only the fourth player in program history to have a 20-rebound game. Junior Kelsey Plum became the fastest to 2,000 points in Pac-12 history, doing so in 88 games. Plum became UW’s career leading scorer and averaged 25.9 points.",
    "link": "http://www.seattletimes.com/sports/uw-husky-basketball/heres-whats-made-uws-kelsey-plum-one-of-the-most-prolific-scorers-in-pac-12-basketball-history/",
    "linktext": "What made Kelsey Plum one of the most prolific scorers in Pac-12 basketball history",
    "image": "introslide.jpg",
    "credit": "Dean Rutz / The Seattle Times"
  },
  {
    "title": "2",
    "order": "2",
    "overlay": "right",
    "name": "Pac-12 tournament",
    "score": "2-1 Tournament Record",
    "chatter": "Even with great individual performances, the Huskies went 1-5 against the top four teams in the Pac-12 and finished the regular season 20-9 overall. UW found a spark in the conference tournament at KeyArena, winning two games for the first time, including a victory over Stanford. After a 57-55 loss to fellow eventual Final Four team Oregon State in the Pac-12 semifinals, UW earned an NCAA tournament berth, getting a No. 7 seed and traveling to College Park, Maryland, for the opening rounds.",
    "link": "http://www.seattletimes.com/sports/uw-husky-basketball/uw-women-cant-complete-comeback-fall-to-osu-in-pac-12-tourney-semifinals/",
    "linktext": "Huskies can't complete comeback, fall to Oregon State in Pac-12 tourney semifinals",
    "image": "pac12tourney.jpg",
    "credit": "Dean Rutz / The Seattle Times"
  },
  {
    "title": "3",
    "order": "3",
    "overlay": "left",
    "name": "First Round vs. Penn",
    "score": "UW 65, Penn 53",
    "chatter": "Plum had 24 points and seven assists, and Walton had 18 points, all of which might be expected. But the contribution of Alexus Atchley, with 11 points and seven rebounds while playing all 40 minutes, was unexpected. It all added up to a 65-53 victory over the Ivy League champion Quakers &mdash; the Huskies’ first NCAA tournament win since 2006. It’s hard to believe now, but the Huskies trailed 13-7 after the first quarter of this game before righting themselves and pulling away in the fourth quarter.",
    "link": "http://www.seattletimes.com/sports/uw-huskies/uw-women-top-penn-for-first-ncaa-tourney-win-since-2006/",
    "linktext": "UW women top Penn for first NCAA tourmanent win since 2006",
    "image": "firstround.jpg",
    "credit": "Patrick Semansky / AP"
  },
  {
    "title": "4",
    "order": "4",
    "overlay": "right",
    "name": "Second Round vs. Maryland",
    "score": "UW 74, Maryland 65",
    "chatter": "By all accounts, this should have been the end of the road for UW. The Huskies faced the No. 5 team in the country on its home floor, a Terps team primed for a third-straight Final Four appearance. But Washington pulled off the upset, as Plum had 32 points, six rebounds and seven assists while Osahor grabbed 15 rebounds in a 74-65 victory. The Huskies advanced to the Sweet 16 for the first time since 2001.",
    "link": "http://www.seattletimes.com/sports/uw-husky-basketball/uw-women-stun-maryland-reach-sweet-16-of-ncaa-tournament/",
    "linktext": "Dawgs stun Maryland to reach Sweet 16 of NCAA tournament",
    "image": "secondround.jpg",
    "credit": "Patrick Semansky / AP"
  },
  {
    "title": "5",
    "order": "5",
    "overlay": "right",
    "name": "Sweet 16 vs. Kentucky",
    "score": "UW 85, Kentucky 72",
    "chatter": "The Huskies kept rolling by beating a ranked team on its campus for the second straight game, this time No. 12 Kentucky by an 85-72 score. UW was in control throughout, thanks to a balanced attack led by Walton, who scored 30 points on 14-of-25 shooting. Osahor had 19 points, 17 rebounds and five assists. UW advanced to the Elite Eight for the third time in school history and set up an unlikely showdown with Stanford, the fourth-place team in the Pac-12, for a spot in the Final Four.",
    "link": "http://www.seattletimes.com/sports/uw-husky-basketball/uw-women-move-on-to-elite-8-after-easy-win-over-kentucky/",
    "linktext": "Huskies move on to Elite Eight after easy win over Kentucky",
    "image": "sweet16.jpg",
    "credit": "Dean Rutz / The Seattle Times"
  },
  {
    "title": "6",
    "order": "6",
    "overlay": "left",
    "name": "Elite Eight vs. Stanford",
    "score": "UW 85, Stanford 76",
    "chatter": "UW’s breakthrough moment was never in doubt as the Huskies led from start to finish against 13th-ranked Stanford. Washington jumped out to a 12-0 lead and was rarely threatened the rest of the way as the Huskies reached the women’s Final Four for the first time in school history. Osahor had 24 points and 18 rebounds and was named the tournament's most outstanding player in the Lexington Region. UW became only the second team in history to reach the women’s Final Four after ending the regular season unranked.",
    "link": "http://www.seattletimes.com/sports/uw-husky-basketball/chantel-osahor-uw-women-advance-to-first-ever-final-four-knock-out-stanford/",
    "linktext": "Chantel Osahor and UW women knock out Stanford, advance to first-ever Final Four",
    "image": "eliteeight.jpg",
    "credit": "Dean Rutz / The Seattle Times"
  },
  {
    "title": "7",
    "order": "7",
    "overlay": "left",
    "name": "Final Four vs. Syracuse",
    "score": "Syracuse 80, UW 59",
    "chatter": "On a historic day that the Pac-12 had two teams play in the women’s Final Four for the first time, the Huskies saw their season come to an end against a relentless Syracuse defense. UW's 80-59 loss featured a strong performance by Walton, who scored 29 points and made a Final Four-record eight three-pointers. But it wasn’t enough as Plum was held to 5-of-18 shooting and 17 points while the Huskies committed 18 turnovers. Despite the disappointing ending, however, UW had completed a season to savor.",
    "link": "http://www.seattletimes.com/sports/uw-huskies/uw-women-fall-to-syracuse-80-59-in-final-four-despite-talia-waltons-29-points/",
    "linktext": "Huskies fall to Syracuse in Final Four despite Talia Walton's 29 points",
    "image": "finalfour.jpg",
    "credit": "Dean Rutz / The Seattle Times"
  }
]