[
  {
    "title": "1",
    "order": "1",
    "rank": "",
    "overlay": "left",
    "name": "2016 Huskies",
    "chatter": "The season began with an easy home win against Santa Clara in which senior Talia Walton set a career high with 33 points and made eight three-pointers (sound familiar?). Junior Chantel Osahor had 12 points and 20 rebounds in a win over Seattle U, becoming only the fourth player in program history to have a 20-rebound game. Junior Kelsey Plum became the fastest to 2,000 points in Pac-12 history, doing so in 88 games. Plum became UW’s career leading scorer and averaged 25.9 points per game.",
    "link": "http://www.seattletimes.com/sports/uw-husky-basketball/heres-whats-made-uws-kelsey-plum-one-of-the-most-prolific-scorers-in-pac-12-basketball-history/",
    "linktext": "",
    "image": "introslide.jpg",
    "credit": "Dean Rutz / The Seattle Times"
  },
  {
    "title": "2",
    "order": "2",
    "rank": "2",
    "overlay": "right",
    "name": "Pac-12 Tournament",
    "chatter": "But even with great individual performances, the Huskies went 1-5 against the top four teams in the Pac-12 and finished 20-9 overall. The Huskies found a spark in the conference tournament at KeyArena, winning two games for the first time, including a victory over Stanford. After a 57-55 loss to fellow Final Four team Oregon State in the Pac-12 semifinals, UW earned an NCAA tournament berth, getting seeded seventh and placed in College Park, Md., for the opening rounds.",
    "link": "http://www.seattletimes.com/sports/uw-husky-basketball/uw-women-cant-complete-comeback-fall-to-osu-in-pac-12-tourney-semifinals/",
    "linktext": "",
    "image": "pac12tourney.jpg",
    "credit": "Dean Rutz / The Seattle Times"
  },
  {
    "title": "3",
    "order": "3",
    "rank": "3",
    "overlay": "left",
    "name": "First Round vs. Penn",
    "chatter": "Plum had 24 points and seven assists and Walton had 18 points, all of which one would expect. But it was the contribution of Alexus Atchley, with 11 points and seven rebounds while playing all 40 minutes, that was unexpected. It all added up to a 65-53 victory over the Ivy League champion Quakers, the Huskies’ first NCAA tournament win since 2006. It’s hard to believe now, but UW trailed 13-7 after the first quarter of this game before righting itself and pulling away in the fourth quarter.",
    "link": "http://www.seattletimes.com/sports/uw-huskies/uw-women-top-penn-for-first-ncaa-tourney-win-since-2006/",
    "linktext": "",
    "image": "firstround.jpg",
    "credit": "Patrick Semansky / AP"
  },
  {
    "title": "4",
    "order": "4",
    "rank": "4",
    "overlay": "right",
    "name": "Second Round vs. Maryland",
    "chatter": "By all accounts, it should have been the end of the road for UW. The Huskies had already ended their NCAA tournament victory drought and they were facing the No. 5 team in the country on its home floor, a Terps team primed for a third straight Final Four appearance. But Washington would not be denied, as Plum had 32 points, six rebounds and seven assists while Osahor grabbed 15 rebounds in the 74-65 victory. The Huskies advanced to the Sweet 16 for the first time since 2001.",
    "link": "http://www.seattletimes.com/sports/uw-husky-basketball/uw-women-stun-maryland-reach-sweet-16-of-ncaa-tournament/",
    "linktext": "",
    "image": "secondround.jpg",
    "credit": "Patrick Semansky / AP"
  },
  {
    "title": "5",
    "order": "5",
    "rank": "5",
    "overlay": "right",
    "name": "Sweet 16 vs. Kentucky",
    "chatter": "The Huskies kept it rolling by beating a ranked team on its campus for the second straight game, this time No. 12 Kentucky by an 85-72 score. UW was in control throughout thanks to a balanced attack led by Walton, who scored 30 points on 14-of-25 shooting. Osahor had 19 points, 17 rebounds and five assists. UW advanced to the Elite Eight for the third time in school history and set up an unlikely showdown with Stanford, the fourth-place team in the Pac-12, for a spot in the Final Four.",
    "link": "http://www.seattletimes.com/sports/uw-husky-basketball/uw-women-move-on-to-elite-8-after-easy-win-over-kentucky/",
    "linktext": "",
    "image": "sweet16.jpg",
    "credit": "Dean Rutz / The Seattle Times"
  },
  {
    "title": "6",
    "order": "6",
    "rank": "6",
    "overlay": "left",
    "name": "Elite Eight vs. Stanford",
    "chatter": "UW’s breakthrough moment was never in doubt as the Huskies led from start to finish against 13th-ranked Stanford. Washington jumped out to a 12-0 lead and was rarely threatened the rest of the way as the Huskies reached the women’s Final Four for the first time in school history. Osahor had 24 points and 18 rebounds and was named the Lexington Regional’s most outstanding player. UW became only the second team in history to reach the women’s Final Four after ending the regular season unranked.",
    "link": "http://www.seattletimes.com/sports/uw-husky-basketball/chantel-osahor-uw-women-advance-to-first-ever-final-four-knock-out-stanford/",
    "linktext": "",
    "image": "eliteeight.jpg",
    "credit": "Dean Rutz / The Seattle Times"
  },
  {
    "title": "7",
    "order": "7",
    "rank": "7",
    "overlay": "left",
    "name": "Final Four vs. Syracuse",
    "chatter": "On a historic day in which the Pac-12 had two teams play in the women’s Final Four for the first time, the Huskies saw their season come to an end against a relentless Syracuse defense. The 80-59 loss did feature a strong performance by Walton, who scored 29 points and made a Final-Four record eight three-pointers. But it wasn’t enough as Plum was held to 5-of-18 shooting and 17 points while the Huskies committed 18 turnovers. But despite the disappointing ending, UW had completed a season to savor.",
    "link": "http://www.seattletimes.com/sports/uw-huskies/uw-women-fall-to-syracuse-80-59-in-final-four-despite-talia-waltons-29-points/",
    "linktext": "",
    "image": "finalfour.jpg",
    "credit": "Dean Rutz / The Seattle Times"
  }
]